[
  {
    "verse": "1 Nephi 3:7 - And it came to pass that I, Nephi, said unto my father: I will go and do the things which the Lord hath commanded, for I know that the Lord giveth no commandments unto the children of men, save he shall prepare a way for them that they may accomplish the thing which he commandeth them.",
    "excerpt": "Nephi’s faith teaches us that God always provides a way to accomplish His commandments."
  },
  {
    "verse": "Alma 32:21 - Faith is not to have a perfect knowledge of things; therefore if ye have faith ye hope for things which are not seen, which are true.",
    "excerpt": "True faith allows us to believe in what we cannot see, trusting in the unseen."
  },
  {
    "verse": "Ether 12:6 - And now, I, Moroni, would speak somewhat concerning these things; I would show unto the world that faith is things which are hoped for and not seen; wherefore, dispute not because ye see not, for ye receive no witness until after the trial of your faith.",
    "excerpt": "Moroni reminds us that faith often requires enduring trials before receiving confirmation."
  },
  {
    "verse": "2 Nephi 2:27 - Wherefore, men are free according to the flesh; and all things are given them which are expedient unto man. And they are free to choose liberty and eternal life, through the great Mediator of all men, or to choose captivity and death, according to the captivity and power of the devil; for he seeketh that all men might be miserable like unto himself.",
    "excerpt": "We are free to choose between liberty through Christ or captivity through sin."
  },
  {
    "verse": "Mosiah 4:9 - Believe in God; believe that He is, and that He created all things, both in heaven and in earth; believe that He has all wisdom, and all power, both in heaven and in earth; believe that man doth not comprehend all the things which the Lord can comprehend.",
    "excerpt": "We are invited to have faith in God’s wisdom, knowing that His understanding far exceeds ours."
  },
  {
    "verse": "Ether 12:27 - And if men come unto me I will show unto them their weakness. I give unto men weakness that they may be humble; and my grace is sufficient for all men that humble themselves before me; for if they humble themselves before me, and have faith in me, then will I make weak things become strong unto them.",
    "excerpt": "God's grace turns our weaknesses into strengths if we humble ourselves before Him."
  },
  {
    "verse": "Mosiah 2:17 - When ye are in the service of your fellow beings ye are only in the service of your God.",
    "excerpt": "Serving others is the same as serving God, as it reflects His love for His children."
  },
  {
    "verse": "Alma 37:6 - Now ye may suppose that this is foolishness in me; but behold I say unto you, that by small and simple things are great things brought to pass; and small means in many instances doth confound the wise.",
    "excerpt": "Great outcomes often result from small, simple actions guided by faith."
  },
  {
    "verse": "2 Nephi 25:26 - And we talk of Christ, we rejoice in Christ, we preach of Christ, we prophesy of Christ, and we write according to our prophecies, that our children may know to what source they may look for a remission of their sins.",
    "excerpt": "Our lives and teachings should center on Christ, helping others find redemption."
  },
  {
    "verse": "3 Nephi 12:16 - Therefore let your light so shine before this people, that they may see your good works and glorify your Father who is in heaven.",
    "excerpt": "By living righteously, we inspire others to glorify God."
  },
  {
    "verse": "Alma 34:32 - For behold, this life is the time for men to prepare to meet God; yea, behold the day of this life is the day for men to perform their labors.",
    "excerpt": "This life is a precious opportunity to prepare spiritually for our eternal destiny."
  },
  {
    "verse": "2 Nephi 2:25 - Adam fell that men might be; and men are, that they might have joy.",
    "excerpt": "The purpose of life is to find joy, which comes through Christ’s redemption."
  },
  {
    "verse": "Jacob 2:18 - But before ye seek for riches, seek ye for the kingdom of God.",
    "excerpt": "We are urged to prioritize God’s kingdom over material wealth."
  },
  {
    "verse": "Mosiah 3:19 - For the natural man is an enemy to God, and has been from the fall of Adam, and will be, forever and ever, unless he yields to the enticings of the Holy Spirit, and putteth off the natural man and becometh a saint through the atonement of Christ the Lord, and becometh as a child, submissive, meek, humble, patient, full of love, willing to submit to all things which the Lord seeth fit to inflict upon him, even as a child doth submit to his father.",
    "excerpt": "To align with God, we must overcome our natural tendencies and become like Christ."
  },
  {
    "verse": "Alma 34:34 - Ye cannot say, when ye are brought to that awful crisis, that I will repent, that I will return to my God. Nay, ye cannot say this; for that same spirit which doth possess your bodies at the time that ye go out of this life, that same spirit will have power to possess your body in that eternal world.",
    "excerpt": "Repentance must happen in this life, as our spiritual state in death reflects our choices in life."
  },
  {
    "verse": "3 Nephi 11:14 - Arise and come forth unto me, that ye may thrust your hands into my side, and also that ye may feel the prints of the nails in my hands and in my feet, that ye may know that I am the God of Israel, and the God of the whole earth, and have been slain for the sins of the world.",
    "excerpt": "Christ invites us to know Him personally as our Redeemer, who suffered for the sins of all."
  },
  {
    "verse": "Alma 41:10 - Do not suppose, because it has been spoken concerning restoration, that ye shall be restored from sin to happiness. Behold, I say unto you, wickedness never was happiness.",
    "excerpt": "True happiness can never come through sin, but only through righteousness."
  },
  {
    "verse": "Mosiah 4:30 - But this much I can tell you, that if ye do not watch yourselves, and your thoughts, and your words, and your deeds, and observe the commandments of God, and continue in the faith of what ye have heard concerning the coming of our Lord, even unto the end of your lives, ye must perish. And now, O man, remember, and perish not.",
    "excerpt": "We must always guard our thoughts, words, and deeds, striving to follow God’s commandments."
  },
  {
    "verse": "Helaman 5:12 - And now, my sons, remember, remember that it is upon the rock of our Redeemer, who is Christ, the Son of God, that ye must build your foundation; that when the devil shall send forth his mighty winds, yea, his shafts in the whirlwind, yea, when all his hail and his mighty storm shall beat upon you, it shall have no power over you to drag you down to the gulf of misery and endless wo, because of the rock upon which ye are built, which is a sure foundation, a foundation whereon if men build they cannot fall.",
    "excerpt": "Christ is the only sure foundation. When we build our lives on Him, we are immovable."
  },
  {
    "verse": "Mosiah 2:41 - And moreover, I would desire that ye should consider on the blessed and happy state of those that keep the commandments of God. For behold, they are blessed in all things, both temporal and spiritual; and if they hold out faithful to the end they are received into heaven, that thereby they may dwell with God in a state of never-ending happiness. O remember, remember that these things are true; for the Lord God hath spoken it.",
    "excerpt": "Obedience to God’s commandments leads to both temporal and eternal happiness."
  },
  {
    "verse": "Alma 5:26 - And now behold, I say unto you, my brethren, if ye have experienced a change of heart, and if ye have felt to sing the song of redeeming love, I would ask, can ye feel so now?",
    "excerpt": "We are called to continually renew the spiritual joy and love we once felt."
  },
  {
    "verse": "Mosiah 4:27 - And see that all these things are done in wisdom and order; for it is not requisite that a man should run faster than he has strength. And again, it is expedient that he should be diligent, that thereby he might win the prize; therefore, all things must be done in order.",
    "excerpt": "We should strive to do good in wisdom and patience, without exceeding our capacities."
  },
  {
    "verse": "Alma 36:3 - And now, O my son Helaman, behold, thou art in thy youth, and therefore, I beseech of thee that thou wilt hear my words and learn of me; for I do know that whosoever shall put their trust in God shall be supported in their trials, and their troubles, and their afflictions, and shall be lifted up at the last day.",
    "excerpt": "Trust in God brings support and deliverance, even through trials and afflictions."
  },
  {
    "verse": "Moroni 7:47 - But charity is the pure love of Christ, and it endureth forever; and whoso is found possessed of it at the last day, it shall be well with him.",
    "excerpt": "Charity, the love of Christ, is the highest and most enduring virtue."
  },
  {
    "verse": "2 Nephi 31:20 - Wherefore, ye must press forward with a steadfastness in Christ, having a perfect brightness of hope, and a love of God and of all men. Wherefore, if ye shall press forward, feasting upon the word of Christ, and endure to the end, behold, thus saith the Father: Ye shall have eternal life.",
    "excerpt": "Endurance in faith and love, along with continual study of Christ’s word, leads to eternal life."
  },
  {
    "verse": "Ether 12:11 - And by faith all things are fulfilled—wherefore, whoso believeth in God might with surety hope for a better world, yea, even a place at the right hand of God, which hope cometh of faith, maketh an anchor to the souls of men, which would make them sure and steadfast, always abounding in good works, being led to glorify God.",
    "excerpt": "Faith is the anchor of our souls, providing hope for eternal life and strength for good works."
  },
  {
    "verse": "Alma 13:28 - But that ye would humble yourselves before the Lord, and call on his holy name, and watch and pray continually, that ye may not be tempted above that which ye can bear, and thus be led by the Holy Spirit, becoming humble, meek, submissive, patient, full of love and all long-suffering.",
    "excerpt": "Through humility, prayer, and vigilance, we gain strength to resist temptation and grow spiritually."
  },
  {
    "verse": "Moroni 10:32 - Yea, come unto Christ, and be perfected in him, and deny yourselves of all ungodliness; and if ye shall deny yourselves of all ungodliness, and love God with all your might, mind and strength, then is his grace sufficient for you, that by his grace ye may be perfect in Christ; and if by the grace of God ye are perfect in Christ, ye can in nowise deny the power of God.",
    "excerpt": "Christ’s grace perfects us as we love God and turn away from all ungodliness."
  },
  {
    "verse": "Alma 38:12 - Use boldness, but not overbearance; and also see that ye bridle all your passions, that ye may be filled with love; see that ye refrain from idleness.",
    "excerpt": "We are encouraged to show boldness tempered with love, while exercising self-control and diligence."
  },
  {
    "verse": "Helaman 3:35 - Nevertheless they did fast and pray oft, and did wax stronger and stronger in their humility, and firmer and firmer in the faith of Christ, unto the filling their souls with joy and consolation, yea, even to the purifying and the sanctification of their hearts, which sanctification cometh because of their yielding their hearts unto God.",
    "excerpt": "Humility, prayer, and fasting purify our hearts and increase our faith and joy in Christ."
  },
    {
      "verse": "Mosiah 18:9 - Yea, and are willing to mourn with those that mourn; yea, and comfort those that stand in need of comfort, and to stand as witnesses of God at all times and in all things, and in all places that ye may be in, even until death, that ye may be redeemed of God, and be numbered with those of the first resurrection, that ye may have eternal life.",
      "excerpt": "We are called to support and comfort others and bear witness of God in all situations."
    },
    {
      "verse": "Alma 5:14 - And now behold, I ask of you, my brethren of the church, have ye spiritually been born of God? Have ye received his image in your countenances? Have ye experienced this mighty change in your hearts?",
      "excerpt": "True conversion brings a change in heart, reflecting God’s image in our lives."
    },
    {
      "verse": "3 Nephi 13:33 - But seek ye first the kingdom of God and his righteousness, and all these things shall be added unto you.",
      "excerpt": "When we put God's kingdom first, He provides everything we need."
    },
    {
      "verse": "Mosiah 4:10 - And again, believe that ye must repent of your sins and forsake them, and humble yourselves before God; and ask in sincerity of heart that he would forgive you; and now, if you believe all these things see that ye do them.",
      "excerpt": "Belief must be followed by sincere repentance and humility before God."
    },
    {
      "verse": "Alma 12:24 - And we see that death comes upon mankind, yea, the death which has been spoken of by Amulek, which is the temporal death; nevertheless there was a space granted unto man in which he might repent; therefore this life became a probationary state; a time to prepare to meet God; a time to prepare for that endless state which has been spoken of by us, which is after the resurrection of the dead.",
      "excerpt": "This life is our time to repent and prepare to meet God after resurrection."
    },
    {
      "verse": "Moroni 7:33 - And Christ hath said: If ye will have faith in me ye shall have power to do whatsoever thing is expedient in me.",
      "excerpt": "Faith in Christ gives us the power to accomplish His will."
    },
    {
      "verse": "Helaman 5:8 - And now my sons, behold, I have somewhat more to desire of you, which desire is, that ye may not do these things that ye may boast, but that ye may do these things to lay up for yourselves a treasure in heaven, yea, which is eternal, and which fadeth not away; yea, that ye may have that precious gift of eternal life, which we have reason to suppose hath been given to our fathers.",
      "excerpt": "We should focus on storing up treasures in heaven rather than boasting of earthly accomplishments."
    },
    {
      "verse": "Ether 12:4 - Wherefore, whoso believeth in God might with surety hope for a better world, yea, even a place at the right hand of God, which hope cometh of faith, maketh an anchor to the souls of men, which would make them sure and steadfast, always abounding in good works, being led to glorify God.",
      "excerpt": "Faith in God gives us hope for a better world and anchors our souls."
    },
    {
      "verse": "Mosiah 4:30 - But this much I can tell you, that if ye do not watch yourselves, and your thoughts, and your words, and your deeds, and observe the commandments of God, and continue in the faith of what ye have heard concerning the coming of our Lord, even unto the end of your lives, ye must perish. And now, O man, remember, and perish not.",
      "excerpt": "We are reminded to continually watch our thoughts, words, and deeds to remain faithful."
    },
    {
      "verse": "Alma 17:11 - And the Lord said unto them also: Go forth among the Lamanites, thy brethren, and establish my word; yet ye shall be patient in long-suffering and afflictions, that ye may show forth good examples unto them in me, and I will make an instrument of thee in my hands unto the salvation of many souls.",
      "excerpt": "God calls us to be patient and long-suffering as we share His word and lead others to salvation."
    },
    {
      "verse": "Moroni 6:8 - But as oft as they repented and sought forgiveness, with real intent, they were forgiven.",
      "excerpt": "God’s forgiveness is always available to those who seek it with real intent."
    },
    {
      "verse": "2 Nephi 9:7 - Wherefore, it must needs be an infinite atonement—save it should be an infinite atonement this corruption could not put on incorruption. Wherefore, the first judgment which came upon man must needs have remained to an endless duration. And if so, this flesh must have laid down to rot and to crumble to its mother earth, to rise no more.",
      "excerpt": "The infinite atonement of Christ allows us to overcome death and sin."
    },
    {
      "verse": "Ether 12:27 - And if men come unto me I will show unto them their weakness. I give unto men weakness that they may be humble; and my grace is sufficient for all men that humble themselves before me; for if they humble themselves before me, and have faith in me, then will I make weak things become strong unto them.",
      "excerpt": "Through humility and faith, God transforms our weaknesses into strengths."
    },
    {
      "verse": "Mosiah 5:7 - And now, because of the covenant which ye have made ye shall be called the children of Christ, his sons, and his daughters; for behold, this day he hath spiritually begotten you; for ye say that your hearts are changed through faith on his name; therefore, ye are born of him and have become his sons and his daughters.",
      "excerpt": "By covenant, we become spiritually begotten sons and daughters of Christ."
    },
    {
      "verse": "Alma 36:18 - Now, as my mind caught hold upon this thought, I cried within my heart: O Jesus, thou Son of God, have mercy on me, who am in the gall of bitterness, and am encircled about by the everlasting chains of death.",
      "excerpt": "In his moment of despair, Alma found deliverance by calling upon Jesus Christ."
    },
    {
      "verse": "3 Nephi 27:20 - Now this is the commandment: Repent, all ye ends of the earth, and come unto me and be baptized in my name, that ye may be sanctified by the reception of the Holy Ghost, that ye may stand spotless before me at the last day.",
      "excerpt": "Repentance and baptism sanctify us, preparing us to stand spotless before God."
    },
    {
      "verse": "Alma 7:11-12 - And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people. And he will take upon him death, that he may loose the bands of death which bind his people; and he will take upon him their infirmities, that his bowels may be filled with mercy, according to the flesh, that he may know according to the flesh how to succor his people according to their infirmities.",
      "excerpt": "Christ took upon Him all our pains, sicknesses, and infirmities, so He could fully understand and succor us."
    },
    {
      "verse": "2 Nephi 25:23 - For we labor diligently to write, to persuade our children, and also our brethren, to believe in Christ, and to be reconciled to God; for we know that it is by grace that we are saved, after all we can do.",
      "excerpt": "Our works matter, but ultimately, it is by God’s grace that we are saved."
    },
    {
      "verse": "Helaman 12:3 - And thus we see that except the Lord doth chasten his people with many afflictions, yea, except he doth visit them with death and with terror, and with famine and with all manner of pestilence, they will not remember him.",
      "excerpt": "Often, it is through affliction and chastening that people turn back to God."
    },
    {
      "verse": "Alma 34:33 - And now, as I said unto you before, as ye have had so many witnesses, therefore, I beseech of you that ye do not procrastinate the day of your repentance until the end; for after this day of life, which is given us to prepare for eternity, behold, if we do not improve our time while in this life, then cometh the night of darkness wherein there can be no labor performed.",
      "excerpt": "We are urged not to delay repentance, as this life is our time to prepare for eternity."
    },
    {
      "verse": "Mosiah 5:15 - Therefore, I would that ye should be steadfast and immovable, always abounding in good works, that Christ, the Lord God Omnipotent, may seal you his, that you may be brought to heaven, that ye may have everlasting salvation and eternal life, through the wisdom, and power, and justice, and mercy of him who created all things, in heaven and in earth, who is God above all. Amen.",
      "excerpt": "Being steadfast in good works allows us to receive Christ’s seal and eternal life."
    }
  ]

